---
title: "Pandas List the Unique Values in a Column"
description: "find the unique values in a column pandas"
tags: Pandas, Data Cleaning / Preprocessing
URL:
Licence:

---

Special thanks to Bob Haffner for pointing out a better way of doing it.

# List Unique Values of a Column in Pandas

In [11]:
# List unique values in the df['name'] column
df.name.unique()

array(['Ricky', 'Bobby', 'Tina', 'Fey', 'Forrest', 'Gump'], dtype=object)

---

## Example

### Preliminaries

In [2]:
# import modules
import pandas as pd

### Create an Example DataFrame

In [9]:
# Create an example dataframe
data = {'name': ['Ricky', 'Bobby', 'Tina', 'Fey', 'Forrest', 'Gump'], 
        'year': [2012, 2012, 2013, 2014, 2014, 2019], 
        'reports': [4, 24, 31, 2, 3, 9]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma', 'Quincy'])
df

               name  year  reports
Cochice       Ricky  2012        4
Pima          Bobby  2012       24
Santa Cruz     Tina  2013       31
Maricopa        Fey  2014        2
Yuma        Forrest  2014        3
Quincy         Gump  2019        9

## List unique values

In [10]:
#List unique values in the df['name'] column
df.name.unique()

array(['Ricky', 'Bobby', 'Tina', 'Fey', 'Forrest', 'Gump'], dtype=object)